jdb333333/ER007/EOSTCPIP/stm32f2x7_eth_bsp - 副本.c
/**
  ******************************************************************************
  * @file    stm32f2x7_eth_bsp.c
  * @author  MCD Application Team
  * @version V1.1.0
  * @date    07-October-2011
  * @brief   STM32F2x7 Ethernet hardware configuration.
  ******************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f2x7_eth.h"
#include "stm32f2x7_eth_bsp.h"
#include "Ethernet_app.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
__IO uint32_t  EthInitStatus = 0;
__IO uint8_t EthLinkStatus = 0;

/* Private function prototypes -----------------------------------------------*/
static void ETH_GPIO_Config(void);
static void ETH_NVIC_Config(void);
static void ETH_MACDMA_Config(void);

/* Private functions ---------------------------------------------------------*/

/**
  * @brief  ETH_BSP_Config
  * @param  None
  * @retval None
  */
void ETH_BSP_Config(void)
{
  RCC_ClocksTypeDef RCC_Clocks;

  /* Configure the GPIO ports for ethernet pins */
  ETH_GPIO_Config();

  /* Config NVIC for Ethernet */
  ETH_NVIC_Config();

  /* Configure the Ethernet MAC/DMA */
  ETH_MACDMA_Config();

  if (EthInitStatus == 0)
  {
#ifdef FOR_DEBUG //ouhs test
    xputs("   Ethernet Init   \n");
    xputs("      failed      \n");
#endif
  }

  /* Configure the PHY to generate an interrupt on change of link status */
  Eth_Link_PHYITConfig(IP101_PHY_ADDRESS);

  /* Configure the EXTI for Ethernet link status. */
  Eth_Link_EXTIConfig();

#if 0 //ouhs
  /* Configure Systick clock source as HCLK */
  SysTick_CLKSourceConfig(SysTick_CLKSource_HCLK);

  /* SystTick configuration: an interrupt every 10ms */
  RCC_GetClocksFreq(&RCC_Clocks);
  SysTick_Config(RCC_Clocks.HCLK_Frequency / 100);

#endif//ouhs
}

/**
  * @brief  Configures the Ethernet Interface
  * @param  None
  * @retval None
  */
static void ETH_MACDMA_Config(void)
{
  ETH_InitTypeDef ETH_InitStructure;

  /* Enable ETHERNET clock  */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_ETH_MAC | RCC_AHB1Periph_ETH_MAC_Tx |
                        RCC_AHB1Periph_ETH_MAC_Rx, ENABLE);

  /* Reset ETHERNET on AHB Bus */
  ETH_DeInit();

  /* Software reset */
  ETH_SoftwareReset();

  /* Wait for software reset */
  while (ETH_GetSoftwareResetStatus() == SET);

  /* ETHERNET Configuration --------------------------------------------------*/
  /* Call ETH_StructInit if you don't like to configure all ETH_InitStructure parameter */
  ETH_StructInit(&ETH_InitStructure);

  /* Fill ETH_InitStructure parametrs */
  /*------------------------   MAC   -----------------------------------*/
  //ETH_InitStructure.ETH_AutoNegotiation = ETH_AutoNegotiation_Enable;
  ETH_InitStructure.ETH_AutoNegotiation = ETH_AutoNegotiation_Disable;
  ETH_InitStructure.ETH_Speed = ETH_Speed_100M;//ouhs20171018 ETH_Speed_10M; 改为100M才能使IP101G网口灯LED3亮
  ETH_InitStructure.ETH_Mode = ETH_Mode_FullDuplex;

  ETH_InitStructure.ETH_LoopbackMode = ETH_LoopbackMode_Disable;
  ETH_InitStructure.ETH_RetryTransmission = ETH_RetryTransmission_Disable;
  ETH_InitStructure.ETH_AutomaticPadCRCStrip = ETH_AutomaticPadCRCStrip_Disable;
  ETH_InitStructure.ETH_ReceiveAll = ETH_ReceiveAll_Disable;
  ETH_InitStructure.ETH_BroadcastFramesReception = ETH_BroadcastFramesReception_Enable;
  ETH_InitStructure.ETH_PromiscuousMode = ETH_PromiscuousMode_Disable;
  ETH_InitStructure.ETH_MulticastFramesFilter = ETH_MulticastFramesFilter_Perfect;
  ETH_InitStructure.ETH_UnicastFramesFilter = ETH_UnicastFramesFilter_Perfect;
#ifdef CHECKSUM_BY_HARDWARE
  ETH_InitStructure.ETH_ChecksumOffload = ETH_ChecksumOffload_Enable;
#endif

  /*------------------------   DMA   -----------------------------------*/

  /* When we use the Checksum offload feature, we need to enable the Store and Forward mode:
  the store and forward guarantee that a whole frame is stored in the FIFO, so the MAC can insert/verify the checksum,
  if the checksum is OK the DMA can handle the frame otherwise the frame is dropped */
  ETH_InitStructure.ETH_DropTCPIPChecksumErrorFrame = ETH_DropTCPIPChecksumErrorFrame_Enable;
  ETH_InitStructure.ETH_ReceiveStoreForward = ETH_ReceiveStoreForward_Enable;
  ETH_InitStructure.ETH_TransmitStoreForward = ETH_TransmitStoreForward_Enable;

  ETH_InitStructure.ETH_ForwardErrorFrames = ETH_ForwardErrorFrames_Disable;
  ETH_InitStructure.ETH_ForwardUndersizedGoodFrames = ETH_ForwardUndersizedGoodFrames_Disable;
  ETH_InitStructure.ETH_SecondFrameOperate = ETH_SecondFrameOperate_Enable;
  ETH_InitStructure.ETH_AddressAlignedBeats = ETH_AddressAlignedBeats_Enable;
  ETH_InitStructure.ETH_FixedBurst = ETH_FixedBurst_Enable;
  ETH_InitStructure.ETH_RxDMABurstLength = ETH_RxDMABurstLength_32Beat;
  ETH_InitStructure.ETH_TxDMABurstLength = ETH_TxDMABurstLength_32Beat;
  ETH_InitStructure.ETH_DMAArbitration = ETH_DMAArbitration_RoundRobin_RxTx_2_1;

  /* Configure Ethernet */
  EthInitStatus = ETH_Init(&ETH_InitStructure, DP83848_PHY_ADDRESS);

  /* Enable the Ethernet Rx Interrupt */
  ETH_DMAITConfig(ETH_DMA_IT_NIS | ETH_DMA_IT_R, ENABLE);
}

/**
  * @brief  Configures the different GPIO ports.
  * @param  None
  * @retval None
  */
void ETH_GPIO_Config(void)
{
   GPIO_InitTypeDef GPIO_InitStructure;

  /* Enable GPIOs clocks */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA | RCC_AHB1Periph_GPIOC |
                         RCC_AHB1Periph_GPIOG, ENABLE);

  /* Enable SYSCFG clock */
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);

  /* Configure MCO (PA8) */
/* //ouhs20170106
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL ;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
*/
  /* MII/RMII Media interface selection --------------------------------------*/
#ifdef MII_MODE /* Mode MII with STM322xG-EVAL  */
 #ifdef PHY_CLOCK_MCO

  /* Output HSE clock (25MHz) on MCO pin (PA8) to clock the PHY */
  RCC_MCO1Config(RCC_MCO1Source_HSE, RCC_MCO1Div_1);
 #endif /* PHY_CLOCK_MCO */

  SYSCFG_ETH_MediaInterfaceConfig(SYSCFG_ETH_MediaInterface_MII);
#elif defined RMII_MODE  /* Mode RMII with STM322xG-EVAL */
   /* for RMII mode you have to set the system clock frequency to 100MHz,
     you can do this in system_stm32f2xx.c file */
   /* Configure MCO (PA8) */
/*//ouhs20170106
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
*/
  /* Output PLL clock divided by 2 (50MHz) on MCO pin (PA8) to clock the PHY */
  RCC_MCO1Config(RCC_MCO1Source_PLLCLK, RCC_MCO1Div_2);

  SYSCFG_ETH_MediaInterfaceConfig(SYSCFG_ETH_MediaInterface_RMII);
#endif

/* Ethernet pins configuration ************************************************/
   /*
        ETH_MDIO --------------------------> PA2
        ETH_MDC ---------------------------> PC1

        ETH_RMII_REF_CLK ------------------> PA1
        ETH_RMII_CRS_DV -------------------> PA7

        ETH_RMII_RXD0 ---------------------> PC4
        ETH_RMII_RXD1 ---------------------> PC5

        ETH_RMII_TX_EN --------------------> PG11//B11
        ETH_RMII_TXD0 ---------------------> PG13//B12
        ETH_RMII_TXD1 ---------------------> PG14//B13
  */

  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA|RCC_AHB1Periph_GPIOC | RCC_AHB1Periph_GPIOG, ENABLE);

  /* Configure PA1, PA2 and PA7 */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_7;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_25MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;//GPIO_PuPd_NOPULL ;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource1, GPIO_AF_ETH);
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource2, GPIO_AF_ETH);
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource7, GPIO_AF_ETH);



  /* Configure PC1, PC2, PC3, PC4 and PC5 */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1 | GPIO_Pin_4 | GPIO_Pin_5;
  GPIO_Init(GPIOC, &GPIO_InitStructure);
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource1, GPIO_AF_ETH);
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource4, GPIO_AF_ETH);
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource5, GPIO_AF_ETH);

  /* Configure PG11, PG13, PG14 */
  GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_11 | GPIO_Pin_13 | GPIO_Pin_14;
  GPIO_Init(GPIOG, &GPIO_InitStructure);

  GPIO_PinAFConfig(GPIOG, GPIO_PinSource11, GPIO_AF_ETH);
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource13, GPIO_AF_ETH);
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource14, GPIO_AF_ETH);
}

/**
  * @brief  Configures and enable the Ethernet global interrupt.
  * @param  None
  * @retval None
  */
void ETH_NVIC_Config(void)
{
  NVIC_InitTypeDef   NVIC_InitStructure;

  /* 2 bit for pre-emption priority, 2 bits for subpriority */
  NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);

  /* Enable the Ethernet global Interrupt */
  NVIC_InitStructure.NVIC_IRQChannel = ETH_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
}

/**
  * @brief  Configure the PHY to generate an interrupt on change of link status.
  * @param PHYAddress: external PHY address
  * @retval None
  */
uint32_t Eth_Link_PHYITConfig(uint16_t PHYAddress)
{
  uint32_t tmpreg = 0;

#if PHY_DP83848C	//DP83848C

  /* Read MICR register */
  tmpreg = ETH_ReadPHYRegister(PHYAddress, PHY_MICR);

  /* Enable output interrupt events to signal via the INT pin */
  tmpreg |= (uint32_t)PHY_MICR_INT_EN | PHY_MICR_INT_OE;
  if(!(ETH_WritePHYRegister(PHYAddress, PHY_MICR, tmpreg)))
  {
    /* Return ERROR in case of write timeout */
    return ETH_ERROR;
  }

  /* Read MISR register */
  tmpreg = ETH_ReadPHYRegister(PHYAddress, PHY_MISR);

  /* Enable Interrupt on change of link status */
  tmpreg |= (uint32_t)PHY_MISR_LINK_INT_EN;
  if(!(ETH_WritePHYRegister(PHYAddress, PHY_MISR, tmpreg)))
  {
    /* Return ERROR in case of write timeout */
    return ETH_ERROR;
  }

#else //IP101A  IP101G
	
//>>>>ouhs 20171018 仅IP101G有效:设置复用管脚功能为INTR 	
	tmpreg = ETH_ReadPHYRegister(PHYAddress, PHY_IOCTRL);
	tmpreg |= (uint32_t)PHY_IOCTRL_SELINTR;
	if(!(ETH_WritePHYRegister(PHYAddress, PHY_IOCTRL, tmpreg)))
   ;//return ETH_ERROR;
//<<<<	
	
	//读取MICR寄存器
  tmpreg = ETH_ReadPHYRegister(PHYAddress, PHY_MICR);

	//使能INTR中断输出、使能全局中断、使能LINK中断
	tmpreg |= (uint32_t)PHY_MICR_INT_OE;
	tmpreg &= ~(uint32_t)(PHY_MICR_INT_EN | PHY_MICR_LINK_INT_EN);
  if(!(ETH_WritePHYRegister(PHYAddress, PHY_MICR, tmpreg)))
  {
    /* Return ERROR in case of write timeout */
    return ETH_ERROR;
  }

	//读取MICR用于清Link中断标志
	ETH_ReadPHYRegister(PHYAddress, PHY_MICR);

#endif

  /* Return SUCCESS */
  return ETH_SUCCESS;
}

/**
  * @brief  EXTI configuration for Ethernet link status.
  * @param PHYAddress: external PHY address
  * @retval None
  */
void Eth_Link_EXTIConfig(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;
  EXTI_InitTypeDef EXTI_InitStructure;
  NVIC_InitTypeDef NVIC_InitStructure;

  /* Enable the INT (PC3) Clock */
  RCC_AHB1PeriphClockCmd(ETH_LINK_GPIO_CLK, ENABLE);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);

  /* Configure INT pin as input */
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_InitStructure.GPIO_Pin = ETH_LINK_PIN;
  GPIO_Init(ETH_LINK_GPIO_PORT, &GPIO_InitStructure);

  /* Connect EXTI Line to INT Pin */
  SYSCFG_EXTILineConfig(ETH_LINK_EXTI_PORT_SOURCE, ETH_LINK_EXTI_PIN_SOURCE);

  /* Configure EXTI line */
  EXTI_InitStructure.EXTI_Line = ETH_LINK_EXTI_LINE;
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
  EXTI_Init(&EXTI_InitStructure);

  /* Enable and set the EXTI interrupt to the highest priority */
  NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
  NVIC_InitStructure.NVIC_IRQChannel = ETH_LINK_EXTI_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
}

/**
  * @brief  This function handles Ethernet link status.
  * @param  None
  * @retval None
  */
void Eth_Link_ITHandler(uint16_t PHYAddress)
{
#if PHY_DP83848C	//DP83848C
  /* Check whether the link interrupt has occurred or not */
  if(((ETH_ReadPHYRegister(PHYAddress, PHY_MISR)) & PHY_LINK_STATUS) != 0)
  {
    EthLinkStatus = ~EthLinkStatus;

    if(EthLinkStatus != 0)
      xputs(" Network Cable is unplugged \n");
    else
      xputs(" Network Cable is connected \n");
  }
	
#else //IP101A IP101G	  //通过检测网线状态强制改变PHY Power mode
	uint32_t tmpreg = 0;

	tmpreg = ETH_ReadPHYRegister(PHYAddress, PHY_MICR);	//读取MICR用于清Link中断标志
	xprintf("\n>PHY_MICR :%x", tmpreg);

	if(((ETH_ReadPHYRegister(PHYAddress, PHY_MISR)) & PHY_LINK_STATUS) != 0)
	{
		xputs(" Network Cable is connected\n");
		EthLinkStatus = 0x01;

		//恢复工作模式
		//PHY进入Power down模式后无法检测网络状态，所以，插入网线后无法自动恢复正常模式。
		//可在插入网线后手动操作调用该函数或重启机器
		//Eth_PHY_PowerModeCtrl(ENABLE);
	}
	else
	{
		xputs(" Network Cable is unplugged\n");
		EthLinkStatus = 0x00;

		//进入Power down 模式
		//ouhs 20180614 不进入PowerDown模式，因为MCR30与交换机连接时会出现一次unplugged然后再connected，与路由器连接没问题
		//Eth_PHY_PowerModeCtrl(DISABLE);
	}
#endif
}

/**
*** 1:网线已连接;  0:网线没有插入
  */
uint8_t Eth_Link_Status(void)
{
	return EthLinkStatus;
}

/**
控制PHY的工作状态：
ENABLE: PHY enter Normal operation
DISABLE：PHY enter Power down
  */
void Eth_PHY_PowerModeCtrl(FunctionalState ctrl)
{
	uint32_t tmpreg;
	tmpreg = ETH_ReadPHYRegister(IP101_PHY_ADDRESS, PHY_BMCR);
	if(ctrl == ENABLE)
	{
		tmpreg &= ~(uint32_t)PHY_BMCR_POWER_DOWN;
		if(ETH_WritePHYRegister(IP101_PHY_ADDRESS, PHY_BMCR, tmpreg))
		{
			//xputs(" PHY Normal operation \n");
		}
	}
	else
	{
		tmpreg |= (uint32_t)PHY_BMCR_POWER_DOWN;
		if(ETH_WritePHYRegister(IP101_PHY_ADDRESS, PHY_BMCR, tmpreg))
		{
			//xputs(" PHY Power down \n");
		}
	}
	ETH_ReadPHYRegister(IP101_PHY_ADDRESS, PHY_MICR);
}

/**
将以太网MAC地址写入OTP Flash，有两个地址用于存放MAC：OTP_FLASH_ADDR(优先)和OTP_FLASH_ADDR+6(备用)
1.写MAC前先读取OTP_FLASH_ADDR是否为全0xff
2.若全为0xff，则将MAC写入OTP_FLASH_ADDR地址
  若不全为0xff，则将MAC与读取的内容比较，相同，则放弃写操作；不同，则将MAC写入OTP_FLASH_ADDR+6地址
  */
uint8_t OTPFlash_WriteMAC(uint8_t* pBuffer)
{
	volatile FLASH_Status FLASHStatus = FLASH_COMPLETE;
	uint8_t i;
	uint32_t MACAddr;
	uint8_t rBuff[6],tmpBuff[6];
	
	//读取MAC_ADDR的数据	
	memcmp(rBuff, (__IO uint8_t*) OTP_FLASH_ADDR, 6);
	memset(tmpBuff, 0xff, 6);
	if(memcmp(rBuff, tmpBuff, 6)==0) //MAC_ADDR地址全为0xff, 空
	{
		MACAddr = OTP_FLASH_ADDR;	//写入MAC_ADDR
	}
	else if(memcmp(rBuff, pBuffer, 6)==0) //已存在相同的MAC地址
	{
		return SUCCESS;
	}
	else
	{
		MACAddr = (OTP_FLASH_ADDR+6);	//写入备用地址MAC_ADDR
	}
	
	FLASH_Unlock();
  for (i=0; i<6; i++)
  {
    FLASHStatus = FLASH_ProgramByte(MACAddr, *pBuffer);
		if(FLASHStatus != FLASH_COMPLETE)
		{
			FLASH_Lock();
			return (ERROR);
		}
    MACAddr++;
		pBuffer++;
  }
	FLASH_Lock();
	
	//读出，验证写入是否正确
	MACAddr -= 6;	
	if(memcmp((__IO uint8_t*) MACAddr, (pBuffer-6), 6)==0)		
		return (SUCCESS);
	else
		return (ERROR);
}

/**
读取OTP Flash中的以太网MAC地址
优先读取MAC_ADDR1，若全为0xff，则读取MAC_ADDR
  */
uint8_t OTPFlash_ReadMAC(uint8_t* pBuffer)
{
	uint8_t i;
	uint32_t MACAddr;
	uint8_t rBuff[6],tmpBuff[6];

	//读取(OTP_FLASH_ADDR+6)的数据
	memcpy(rBuff, (__IO uint8_t*) (OTP_FLASH_ADDR+6), 6);
	memset(tmpBuff, 0xff, 6);
	
	if(memcmp(rBuff, tmpBuff, 6)==0) //(OTP_FLASH_ADDR+6)地址全为0xff,空
		MACAddr = OTP_FLASH_ADDR;	
	else
		MACAddr = (OTP_FLASH_ADDR+6);	
	
	memcpy(pBuffer, (__IO uint8_t*) MACAddr, 6);

	return (SUCCESS);
}


/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
